import imageProduct1 from "./assets/images/1.jpeg";
import imageProduct2 from "./assets/images/2.jpg";
import imageProduct3 from "./assets/images/3.png";
import imageProduct4 from "./assets//images/4.jpg";
import imageProduct5 from "./assets/images/5.jpg";
import imageProduct6 from "./assets/images/6.jpg";
import imageProduct7 from "./assets/images/7.png";
import imageProduct8 from "./assets/images/8.jpg";
export const products = [
  {
    id: 1,
    name: "হাতেকলমে জাভাস্ক্রিপ্ট",
    price: 449,
    image: imageProduct1,
    description:
      "Mollit anim consectetur adipisicing aute pariatur ad mollit ad. Officia amet aliqua non laborum dolore sint sit eu sit sunt laboris. Dolor tempor ipsum culpa Lorem ipsum ullamco ullamco dolor sit do. Do proident quis ad laborum et proident laborum. Non voluptate eiusmod aute labore ea aute.",
    slug: "হাতেকলমে-জাভাস্ক্রিপ্ট",
  },
  {
    id: 2,
    name: "প্রোগ্রামিং কনটেস্ট ডেটা স্ট্রাকচার ও অ্যালগরিদম",
    price: 151,
    image: imageProduct2,
    description:
      'Programming Contest Data Structures and Algorithms" হলো বাংলাদেশের শিক্ষার্থী ও প্রোগ্রামারদের জন্য একটি সম্পূর্ণ গাইড, যারা ICPC, Olympiad এবং অনলাইন কোডিং প্রতিযোগিতা এর জন্য প্রস্তুতি নিচ্ছেন। বইটি মোঃ মাহমুদুল হাসান লিখেছেন এবং জটিল অ্যালগরিদম ও ডেটা স্ট্রাকচার সহজ ও ধাপে ধাপে ব্যাখ্যা করেছেন। বইটিতে আলোচনা করা হয়েছে টাইম কমপ্লেক্সিটি, রিকার্শন, সার্চিং ও সর্টিং অ্যালগরিদম, পাশাপাশি উন্নত বিষয় যেমন গ্রাফ, ট্রি, ডায়নামিক প্রোগ্রামিং, গ্রীডি অ্যালগরিদম এবং সেগমেন্ট ট্রি। প্রতিটি অধ্যায়ে রয়েছে প্র্যাকটিক্যাল উদাহরণ ও সমস্যা সমাধানের কৌশল, যা শিক্ষার্থীদের তত্ত্ব থেকে বাস্তব প্রতিযোগিতার সমস্যায় দক্ষতা অর্জনে সাহায্য করে। এই বইটি বিশেষভাবে বাংলাদেশি শিক্ষার্থীদের জন্য তৈরি, যারা তাদের প্রোগ্রামিং দক্ষতা বৃদ্ধি করে স্থানীয় ও আন্তর্জাতিক প্রতিযোগিতায় আত্মবিশ্বাসের সঙ্গে অংশগ্রহণ করতে চায়।',
    slug: "প্রোগ্রামিং-কনটেস্ট-ডেটা-স্ট্রাকচার-ও-অ্যালগরিদম",
  },
  {
    id: 3,
    name: "৫২টি প্রোগ্রামিং সমস্যা ও সমাধান",
    price: 181,
    image: imageProduct3,
    description:
      "৫২টি প্রোগ্রামিং সমস্যা ও সমাধান হলো বাংলাদেশের শিক্ষার্থী ও প্রোগ্রামারদের জন্য একটি প্র্যাকটিক্যাল গাইড, যারা প্রতিযোগিতামূলক প্রোগ্রামিং যেমন ICPC, Olympiad এবং অনলাইন জাজে দক্ষতা অর্জন করতে চান। বইটিতে বেসিক থেকে অ্যাডভান্সড স্তরের ৫২টি সমস্যা রয়েছে, যা সংখ্যা, স্ট্রিং, অ্যারে, সার্চিং ও সর্টিং, রিকার্শন, ডায়নামিক প্রোগ্রামিং, গ্রাফ, গ্রীডি অ্যালগরিদম এবং বিভিন্ন ডেটা স্ট্রাকচার যেমন স্ট্যাক, কিউ, লিঙ্কড লিস্ট, ট্রি ও সেগমেন্ট ট্রি কভার করে। প্রতিটি সমস্যার ধাপে ধাপে সমাধান ও বিশদ ব্যাখ্যা দেওয়া হয়েছে, যা শিক্ষার্থীদের সমস্যা সমাধানের দক্ষতা বাড়াতে, অ্যালগরিদম চিন্তাভাবনা উন্নত করতে এবং কোডিং কনটেস্টে সফল হতে সাহায্য করে।",
    slug: "৫২টি-প্রোগ্রামিং-সমস্যা-ও-সমাধান",
  },
  {
    id: 4,
    name: "কম্পিউটার প্রোগ্রামিং-প্রথম খণ্ড",
    price: 201,
    image: imageProduct4,
    description:
      "কম্পিউটার প্রোগ্রামিং – প্রথম খণ্ড হলো প্রাথমিক স্তরের শিক্ষার্থীদের জন্য একটি পূর্ণাঙ্গ গাইড, যা প্রোগ্রামিংয়ের মৌলিক ধারণা, লজিক এবং সমস্যার সমাধানের পদ্ধতি শেখায়। বইটিতে কম্পিউটার, প্রোগ্রামিং ভাষা, ডেটা টাইপ, ভ্যারিয়েবল, কন্ডিশনাল স্টেটমেন্ট, লুপ, ফাংশন, অ্যারে এবং স্ট্রিং-এর মতো মূল বিষয়গুলো বিস্তারিতভাবে ব্যাখ্যা করা হয়েছে। প্রতিটি অধ্যায়ে উদাহরণ এবং সহজ সমস্যা সমাধান দেওয়া হয়েছে, যা শিক্ষার্থীদের প্রোগ্রামিং লজিক বোঝার পাশাপাশি কোড লেখা এবং সমস্যা সমাধানে দক্ষ হতে সাহায্য করে। এই খণ্ডটি নতুন প্রোগ্রামারদের জন্য একটি শক্ত ভিত্তি তৈরি করে, যাতে তারা পরবর্তী অগ্রসর স্তরের প্রোগ্রামিং এবং প্রতিযোগিতামূলক প্রোগ্রামিং শেখার জন্য প্রস্তুত হতে পারে।",
    slug: "কম্পিউটার-প্রোগ্রামিং-প্রথম-খণ্ড",
  },
  {
    id: 5,
    name: "ফুলস্ট্যাক ডেভেলপমেন্ট",
    price: 251,
    image: imageProduct5,
    description:
      "ফুলস্ট্যাক ডেভেলপমেন্ট হলো এমন একটি পূর্ণাঙ্গ গাইড যা একজন শিক্ষার্থী বা ডেভেলপারকে ফ্রন্টএন্ড থেকে ব্যাকএন্ড পর্যন্ত ওয়েব অ্যাপ্লিকেশন তৈরি করার সম্পূর্ণ প্রক্রিয়া শেখায়। বইটিতে HTML, CSS, JavaScript, এবং আধুনিক ফ্রেমওয়ার্ক যেমন React বা Vue-এর মাধ্যমে ফ্রন্টএন্ড ডেভেলপমেন্ট শেখানো হয়েছে। পাশাপাশি Node.js, Express, MongoDB বা অন্য ডেটাবেস ব্যবহার করে ব্যাকএন্ড এবং API ডেভেলপমেন্টের ধারণাও দেওয়া হয়েছে। প্রতিটি অধ্যায়ে প্র্যাকটিক্যাল উদাহরণ এবং প্রকল্প ভিত্তিক সমস্যা সমাধান রয়েছে, যা শিক্ষার্থীকে বাস্তব প্রকল্প তৈরি এবং পূর্ণাঙ্গ ওয়েব অ্যাপ্লিকেশন ডেভেলপমেন্টে দক্ষ হতে সাহায্য করে। বইটি নতুন এবং মধ্যম স্তরের ডেভেলপারদের জন্য ফ্রন্টএন্ড ও ব্যাকএন্ড সমন্বিত দক্ষতা অর্জনের আদর্শ হাতিয়ার।.",
    slug: "ফুলস্ট্যাক-ডেভেলপমেন্ট",
  },
  {
    id: 6,
    name: "প্রোগ্রামিং এর আদ্যোপান্ত ",
    price: 111,
    image: imageProduct6,
    description:
      "প্রোগ্রামিং এর আদ্যোপান্ত হলো প্রোগ্রামিং শেখার জন্য একটি পূর্ণাঙ্গ এবং প্র্যাকটিক্যাল গাইড, যা শিক্ষার্থীদের প্রাথমিক থেকে মধ্যম স্তরের প্রোগ্রামিং ধারণা, লজিক ও সমস্যা সমাধান দক্ষতা অর্জনে সাহায্য করে। বইটিতে কনসেপ্ট হিসেবে কভার করা হয়েছে ভ্যারিয়েবল, ডেটা টাইপ, কন্ডিশনাল স্টেটমেন্ট, লুপ, ফাংশন, অ্যারে, স্ট্রিং, স্ট্যাক, কিউ, ট্রি, গ্রাফ এবং ডায়নামিক প্রোগ্রামিং। প্রতিটি অধ্যায়ে উদাহরণ ও ধাপে ধাপে সমাধান প্রদান করা হয়েছে, যা শিক্ষার্থীদের কোড লেখা, অ্যালগরিদম চিন্তাভাবনা এবং বাস্তব সমস্যা সমাধানে দক্ষ হতে সাহায্য করে। এই বইটি নতুন প্রোগ্রামার এবং প্রতিযোগিতামূলক প্রোগ্রামিং প্রস্তুতকারীদের জন্য একটি শক্তিশালী ভিত্তি তৈরি করে, যাতে তারা আরও জটিল প্রোগ্রামিং চ্যালেঞ্জের জন্য প্রস্তুত হতে পারে।",
    slug: "প্রোগ্রামিং-এর-আদ্যোপান্ত",
  },
  {
    id: 7,
    name: "গ্রাফ অ্যালগরিদম",
    price: 121,
    image: imageProduct7,
    description:
      "গ্রাফ অ্যালগরিদম হলো একটি প্র্যাকটিক্যাল গাইড যা শিক্ষার্থী ও প্রোগ্রামারদের গ্রাফ থিওরি এবং গ্রাফ ভিত্তিক অ্যালগরিদম সহজভাবে শেখায়। বইটিতে আলোচনা করা হয়েছে বেসিক গ্রাফ কনসেপ্ট যেমন নোড, এজ, ডিরেক্টেড ও আন্ডিরেক্টেড গ্রাফ, পাশাপাশি BFS, DFS, ডায়জকাস্ট্রা, প্রিম, ক্রুসকাল, ফ্লয়েড-ওয়ারশাল এবং অন্যান্য প্রয়োজনীয় অ্যালগরিদম। প্রতিটি অ্যালগরিদমের ধাপে ধাপে ব্যাখ্যা, উদাহরণ এবং প্র্যাকটিক্যাল সমাধান দেওয়া হয়েছে, যা শিক্ষার্থীদের গ্রাফ সমস্যা বিশ্লেষণ এবং কোডিং কনটেস্টে বাস্তবায়ন করতে সাহায্য করে। বইটি বিশেষভাবে প্রতিযোগিতামূলক প্রোগ্রামিং, ডিএসএ এবং সফটওয়্যার প্রকল্পের জন্য গ্রাফ অ্যালগরিদমের একটি শক্তিশালী ভিত্তি প্রদান করে।",
    slug: "graph-algorithms",
  },
  {
    id: 8,
    name: "প্রোগ্রামিং ক্যারিয়ার গাইড লাইন: এক ডজন প্রোগ্রামারের কথা",
    price: 220,
    image: imageProduct8,
    description:
      "প্রোগ্রামিং ক্যারিয়ার গাইডলাইন: এক ডজন প্রোগ্রামারের কথা হলো একটি প্র্যাকটিক্যাল গাইড যা নতুন প্রোগ্রামারদের ক্যারিয়ার গড়ার পথ এবং সফটওয়্যার ইন্ডাস্ট্রিতে সফল হওয়ার কৌশল শেখায়। বইটিতে এক ডজন সফল প্রোগ্রামারের অভিজ্ঞতা ও পরামর্শ তুলে ধরা হয়েছে, যেগুলো শিক্ষার্থীদের প্রকল্প ভিত্তিক কাজ, সমস্যা সমাধান দক্ষতা, প্রোগ্রামিং লজিক এবং পেশাদার দক্ষতা অর্জনে সাহায্য করে। এছাড়াও বইটিতে ক্যারিয়ার পরিকল্পনা, কোডিং চ্যালেঞ্জ, ইন্টারভিউ প্রস্তুতি এবং অনলাইন জব প্ল্যাটফর্মের ব্যবহার নিয়ে বাস্তবপর্যায়ের দিকনির্দেশনা দেওয়া হয়েছে। এটি নতুন প্রোগ্রামারদের জন্য একটি দিকনির্দেশমূলক হাতিয়ার, যা তাদের পেশাগত জগতে আত্মবিশ্বাসের সঙ্গে প্রবেশ করতে সহায়ক।",
    slug: "programming-career-guide",
  },
];
